{"config": [{"config": {"batch_input_shape": [null, 80, 1], "unit_forget_bias": true, "units": 100, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "kernel_regularizer": null, "stateful": false, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "recurrent_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 0, "recurrent_dropout": 0.0, "return_sequences": false, "go_backwards": false, "bias_regularizer": null, "name": "lstm_1", "trainable": true, "recurrent_regularizer": null, "return_state": false, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"units": 6, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.8"}