{"class_name": "Sequential", "keras_version": "2.0.8", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "stateful": false, "unroll": false, "recurrent_regularizer": null, "bias_constraint": null, "implementation": 0, "bias_regularizer": null, "dtype": "float32", "return_state": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "return_sequences": false, "unit_forget_bias": true, "recurrent_constraint": null, "units": 100, "activity_regularizer": null, "go_backwards": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "batch_input_shape": [null, 80, 1], "name": "lstm_1", "kernel_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "tanh", "use_bias": true}}, {"class_name": "Dense", "config": {"units": 6, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "use_bias": true}}], "backend": "tensorflow"}