{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"kernel_constraint": null, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "stateful": false, "recurrent_constraint": null, "bias_constraint": null, "activation": "tanh", "batch_input_shape": [null, 80, 1], "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "trainable": true, "implementation": 0, "recurrent_dropout": 0.0, "dtype": "float32", "dropout": 0.0, "units": 100, "name": "lstm_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "return_sequences": false, "recurrent_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 6, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "softmax", "use_bias": true}}], "backend": "tensorflow"}